Map<String, String> arLocale = {
  // intro
  'logo': 'نجومي',
  'boarding1_title': 'كل نجمة تصنع فرقًا',
  'boarding1_info':
      'في Starry، يمكنك دعم الحملات الإنسانية\nباستخدام النجوم بدل المبالغ المالية.',

  'boarding2_title': 'تبرّع بطريقة أبسط',
  'boarding2_info':
      'اختر عدد النجوم، تبرّع بسهولة،\n وتابع أثر مساهمتك خطوة بخطوة.',

  'boarding3_title': 'ابدأ فورًا بدون تعقيد',
  'boarding3_info':
      'يمكنك التبرّع مباشرة دون إنشاء حساب،\n أو إنشاء حساب لمتابعة تأثيرك بشكل كامل.',

  'skip': 'تخطي',
  'start_now': 'ابدأ الآن',
  'welcome_title': ' كل نجمة تصنع فرقًا',
  'welcome_subtitle':
      'تبرّع بالنجوم لدعم الحملات الإنسانية ومتابعة أثر تبرعك بكل شفافية',
  'donate_now': 'تبرّع الآن',
  'welcome_extra': 'يمكنك التبرّع مباشرة دون إنشاء حساب',
  'sign_in_up': 'تسجيل الدخول / إنشاء حساب',
  'create_ur_acc': ' أنشئ حسابك في Starry ✨',
  'create_acc_info': 'أنشئ حسابك للبدء في دعم الحملات أو إنشاء حملتك الخاصة.',
  'first_name': 'الاسم الأول',
  'last_name': 'الاسم الأخير',
  'email': 'البريد الإلكتروني',
  'password': 'كلمة المرور',
  'create_acc': 'إنشاء الحساب',
  'have_acc': 'لديك حساب بالفعل ؟ تسجيل الدخول',
  'or': 'أو',
  'login_with_google': 'المتابعة باستخدام Google',
  'login_with_apple': 'المتابعة باستخدام Apple',
  'by_continue': '🔒 بياناتك محمية ولا تتم مشاركة أي معلومات بدون إذنك.',
  'welcome_back': 'مرحبا بعودتك ✨',
  'sign_in_info':
      'أدخل بياناتك للوصول إلى حملاتك وتبرعاتك، ومتابعة الأثر الذي تصنعه نجومك ⭐',
  'login': 'تسجيل الدخول',
  'forgot_password': 'نسيت كلمة المرور؟',
  'dont_have_acc': 'ليس لديك حساب ؟ إنشاء حساب جديد ',
  'frgt_pswd_title': 'نسيت كلمة المرور؟ لا تقلق ✨',
  'frgt_pswd_info':
      'أدخل بريدك الإلكتروني المسجّل لدينا، وسنرسل لك رابطًا آمنًا لإعادة تعيين كلمة المرور.',
  'reset_password': 'إرسال رابط إعادة التعيين',
  'enter_verification': 'أدخل رمز التحقق',
  'verification_info':
      'أرسلنا رمز تحقق مكوّن من 5 أرقام إلى بريدك الإلكتروني. الرجاء إدخال الرمز لإكمال العملية.',
  'sent_to': 'تم الإرسال إلى  ',
  'confirm_code': 'تأكيد الرمز',
  'didnt_recieve_code': 'لم يصلك الرمز؟ إعادة الإرسال ',
  'after': 'بعد ',
  'second': 'ثانية',
  'code_availability': '🔒الرمز صالح لفترة محدودة.',
  'assign_new_pass': '🔑 تعيين كلمة مرور جديدة',
  'assign_new_pass_info': 'اختر كلمة مرور قوية لحماية حسابك',
  'new_password': 'كلمة المرور الجديدة',
  'confirm_new_password': 'تأكيد كلمة المرور الجديدة',
  'first_rule': ' 8 أحرف على الأقل',
  'second_rule': ' تحتوي على رقم',
  'third_rule': 'تحتوي على رمز خاص',
  'fourth_rule': 'كلمتا المرور متطابقتان',
  'update_password': 'تحديث كلمة المرور',
  'go_to_login': 'الانتقال إلى تسجيل الدخول',
  'login_safely': 'يمكنك الاّن تسجيل الدخول بأمان',
  'password_changed': '✅ تم تحديث كلمة المرور بنجاح',
};
